[
    {
        "_id": 123,
        "topic": "Space",
        "userName": "SpaceX",
        "title": "Tesla Cybertruck lands on Mars and picks up the Curiosity rover on its 6' bed",
        "time": "2h",
        "image": "tesla-icon.png",
        "liked": true,
        "disliked": true,
        "replies": 123,
        "retuits": 543,
        "likes": 1234,
        "dislikes": 234,
        "handle": "@spacex",
        "tuit": "You want to wake up in the morning and think the future is going to be great - and that’s what being a spacefaring civilization is all about. It’s about believing in the future and thinking that the future will be better than the past. And I can’t think of anything more exciting than going out there and being among the stars"
    },
    {
        "_id": 234,
        "topic": "Space",
        "userName": "SpaceX",
        "title": "100s of SpaceX Starships land on Mars after a 6 month journey. 1000s of Martian colonists being building Mars Base 1",
        "time": "2h",
        "image": "spacex-icon.png",
        "liked": false,
        "disliked": false,
        "replies": 323,
        "retuits": 643,
        "likes": 1754,
        "dislikes": 234,
        "handle": "@spacex",
        "tuit": "The first ever 3D-printed, methane-fueled rocket will attempt to launch into orbit from Cape Canaveral in Florida on Wednesday. The 33.5 metre (110 foot) Terran 1 rocket, built by California-based startup Relativity Space, uses 3D printed engines and a 3D printed structure to lift up to 1,250 kilograms into low-Earth orbit."
    },
    {
        "_id": 345,
        "topic": "Energy", 
        "userName": "Tesla",
        "title": "Tesla FSD finally makes driving obsolete. After years of delay, Tesla Full Self Driving can drive you to work while you work, play, or sleep",
        "time": "4d",
        "image": "tesla-icon.png",
        "liked": true,
        "disliked": false,
        "replies": 727,
        "retuits": 7227,
        "likes": 9789,
        "dislikes": 234,
        "handle": "@tesla",
        "tuit": "Tesla (NASDAQ: TSLA) shares rose over 5% in Tuesday trading and held onto a gain of 3.6% as of 3:40 p.m. ET. The move came after a vote of confidence from one widely followed tech investor and as CEO Elon Musk chimed in on a report about the company's battery supply."
    }
]
